package com.springapp.mvc.web.config;

/*
 * Created by lyp on 2016-01-22.
 * @author lyp
 * @date 2016-01-22
 * @Description: 保存所有的常亮，使用配置文件配置之前先用此方法存放常量
 * @Version: V1.0
 */
public class Constant {
    //--------------------------------↓接口-------------------------------//
    //↓搜索平台相关URL（提供设备搜索的相关接口）
    private static final String SE_BASEPATH = "http://10.10.2.143:8083/se/";//搜索平台根目录
    public static final String SE_GET_SUGGESTION_URL = SE_BASEPATH + "search/advanced/completionsuggest";//-输入框提示
    public static final String SE_ADVANCED_SEARCH_URL = SE_BASEPATH + "search/advanced?q={q}";//-高级搜索
    public static final String SE_MAP_SEARCH_URL = SE_BASEPATH + "search/map?q={q}";//-地图场景下的搜索
    public static final String SE_LIST_SEARCH_URL = SE_BASEPATH + "search?wd={wd}&page={page}";//-普通（文字）场景下的搜索
    public static final String SE_LIST_SEARCH_2_URL = SE_BASEPATH + "search?q={q}";//-普通（文字）场景下的搜索2
    public static final String SE_MARKPOINT_SEARCH_URL = SE_BASEPATH + "search/mapcluster?q={q}";//-3D设备展示场景下的搜索
    public static final String SE_HOTKEY_URL = SE_BASEPATH + "search/hotkey";//热搜数据。返回值：{"wd":{"freeom":2,"free":1,"time":1}}
    //http://10.10.2.143:8888/count?scale=Global&startTime=0&endTime=1539222405000或http://10.10.2.143:8888/count?scale=Global&size=1
    public static final String SE_GET_SUMMARY_STATISTIC_URL = "http://10.10.2.143:8888/count";//离线分析
    //http://10.10.2.143:8888/agg/n, n∈N+
    public static final String SE_GET_LATEST_STATISTIC_URL = "http://10.10.2.143:8888/agg";//离线分析最近一次扫描聚类
    public static final String SE_GET_ALL_STATISTIC_4_FUSIONCHARTS_URL = "http://10.10.2.143:8888/aggall";//离线分析所有扫描聚类
    public static final String SE_VISION_URL = SE_BASEPATH + "search?";//看世界
    //“看世界”，参数pagesize和page的取值固定
    public static final String SE_VISION_STATIC_URL_OLD = SE_BASEPATH + "search?pagesize=9999&page=1&wd=pictureTags:";
    //只返回有在线图片的设备信息
    public static final String SE_VISION_STATIC_URL = SE_BASEPATH + "search?pagesize=9999&wd=description.other.pictureUrl:http pictureTags:";

    //↓逻辑平台相关URL（提供3D地图数据流展示数据的接口）
    private static final String LG_BASEPATH = "http://10.10.2.84:8082/";//逻辑平台根目录
    public static final String LG_MARKLINE_SEARCH_URL = LG_BASEPATH + "devicescan/getLinesSegment?numPerPage=100&pageId=";

    //↓用户管理平台相关URL（提供用户登录注册服务的相关接口），以下各接口地址的参数和返回值信息参见 http://10.10.2.24:4567/LoginRegistAPI
    private static final String WUM_BASEPATH = "http://10.10.2.174:8080/wum/";
    public static final String WUM_REGISTER_URL = WUM_BASEPATH + "regist/senduserinfo.json";
    public static final String WUM_UNIQUE_USERNAME_CHECK_URL = WUM_BASEPATH + "regist/uniquenamecheck.json";//String username
    public static final String WUM_UNIQUE_EMAIL_CHECK_URL = WUM_BASEPATH + "regist/uniqueemailcheck.json"; //String email
    public static final String WUM_LOGIN_URL = WUM_BASEPATH + "login/validate.json"; //String nam，String psw（密码，前端应该先通过sha1加密一次）
    public static final String WUM_FORGET_PASSWORD = WUM_BASEPATH + "login/forgetpwd.json";  //发送找回密码邮件

    //ArcGis地图相关URL（提供全球各国的区域、中国各省份区域、中国各城市区域的数据）
    private static final String ARCGIS_BASEPATH = "http://10.10.2.81:6080/arcgis/rest/services/";
    public static final String countryFeatureSetURL = ARCGIS_BASEPATH + "world/MapServer/0/query?f=json&where='Shape'='面'&returnGeometry=true&spatialRel=esriSpatialRelIntersects&outFields=NAME,REGION&callback=";
    public static final String provinceFeatureSetURL = ARCGIS_BASEPATH + "sheng/MapServer/0/query?f=json&where='OBJECTID'>'0'&returnGeometry=true&spatialRel=esriSpatialRelIntersects&outFields=*&callback=";
    public static final String cityFeatureSetURL = ARCGIS_BASEPATH + "area/MapServer/1/query?where=OBJECTID+>+1+AND+OBJECTID+<+40&returnGeometry=true&returnIdsOnly=false&returnCountOnly=false&returnZ=false&returnM=false&f=pjson";
    //--------------------------------接口↑-------------------------------//

    //--------------------------------↓数据常量---------------------------//
    //-ArcGis与搜索平台SE提供的数据中，省份名称的映射表
    //json string
    public static final String keyPrefixMapping = "{\"device_type\":\"type\",\"device_brand\":\"brand\",\"device_service\":\"service\",\"vul_type\":\"vul\"}";
    //json string
    public static final String provinceNameMappingArc_ES = "{\"安徽省\":\"安徽\",\"澳门特别行政区\":\"澳门\",\"北京市\":\"北京\",\"福建省\":\"福建\",\"甘肃省\":\"甘肃\",\"广东省\":\"广东\",\"广西壮族自治区\":\"广西\",\"贵州省\":\"贵州\",\"海南省\":\"海南\",\"河北省\":\"河北\",\"河南省\":\"河南\",\"黑龙江省\":\"黑龙江\",\"湖北省\":\"湖北\",\"湖南省\":\"湖南\",\"吉林省\":\"吉林\",\"江苏省\":\"江苏\",\"江西省\":\"江西\",\"辽宁省\":\"辽宁\",\"内蒙古自治区\":\"内蒙古\",\"宁夏回族自治区\":\"宁夏\",\"青海省\":\"青海\",\"山东省\":\"山东\",\"山西省\":\"山西\",\"陕西省\":\"陕西\",\"上海市\":\"上海\",\"四川省\":\"四川\",\"台湾省\":\"台湾\",\"天津市\":\"天津\",\"西藏自治区\":\"西藏\",\"香港特别行政区\":\"香港\",\"新疆维吾尔自治区\":\"新疆\",\"云南省\":\"云南\",\"浙江省\":\"浙江\",\"重庆市\":\"重庆\"}";
    //json string
    public static final String FusionId_CountryName_Mapping = "{\"10\":\"萨尔瓦多\",\"11\":\"格林纳达\",\"12\":\"危地马拉\",\"13\":\"海地\",\"14\":\"洪都拉斯\",\"15\":\"牙买加\",\"16\":\"墨西哥\",\"17\":\"尼加拉瓜\",\"18\":\"巴拿马\",\"19\":\"圣基茨和尼维斯\",\"20\":\"圣卢西亚\",\"21\":\"圣文森特和格林纳丁斯\",\"22\":\"特立尼达和多巴哥\",\"23\":\"美国\",\"24\":\"格陵兰\",\"25\":\"阿根廷\",\"26\":\"玻利维亚\",\"27\":\"巴西\",\"28\":\"智利\",\"29\":\"哥伦比亚\",\"30\":\"厄瓜多尔\",\"31\":\"马尔维纳斯群岛\",\"32\":\"法属圭亚那\",\"33\":\"圭亚那\",\"34\":\"巴拉圭\",\"35\":\"秘鲁\",\"36\":\"苏里南共和国\",\"37\":\"乌拉圭\",\"38\":\"委内瑞拉\",\"39\":\"阿尔及利亚\",\"40\":\"安哥拉\",\"41\":\"贝宁\",\"42\":\"博茨瓦纳\",\"43\":\"布基纳法索\",\"44\":\"布隆迪\",\"45\":\"喀麦隆\",\"46\":\"佛得角\",\"47\":\"中非共和国\",\"48\":\"乍得\",\"49\":\"科摩罗\",\"50\":\"科特迪瓦\",\"51\":\"刚果(金)\",\"52\":\"吉布提\",\"53\":\"埃及\",\"54\":\"赤道几内亚\",\"55\":\"厄立特里亚\",\"56\":\"埃塞俄比亚\",\"57\":\"加蓬\",\"58\":\"加纳\",\"59\":\"几内亚\",\"60\":\"几内亚比绍共和国\",\"61\":\"肯尼亚\",\"62\":\"莱索托\",\"63\":\"利比里亚\",\"64\":\"利比亚\",\"65\":\"马达加斯加\",\"66\":\"马拉维\",\"67\":\"马里\",\"68\":\"毛里塔尼亚\",\"69\":\"摩洛哥\",\"70\":\"莫桑比克\",\"71\":\"纳米比亚\",\"72\":\"尼日尔\",\"73\":\"尼日利亚\",\"74\":\"卢旺达\",\"75\":\"圣多美和普林西比\",\"76\":\"塞内加尔\",\"77\":\"塞舌尔\",\"78\":\"塞拉利昂\",\"79\":\"索马里\",\"80\":\"南非\",\"81\":\"苏丹\",\"82\":\"斯威士兰\",\"83\":\"坦桑尼亚\",\"84\":\"多哥\",\"85\":\"突尼斯\",\"86\":\"乌干达\",\"87\":\"西撒哈拉\",\"88\":\"赞比亚\",\"89\":\"津巴布韦\",\"90\":\"冈比亚\",\"91\":\"刚果(金)\",\"92\":\"毛里求斯\",\"93\":\"阿富汗\",\"94\":\"亚美尼亚\",\"95\":\"阿塞拜疆\",\"96\":\"孟加拉\",\"97\":\"不丹\",\"98\":\"文莱\",\"99\":\"缅甸\",\"100\":\"柬埔寨\",\"101\":\"中国\",\"102\":\"东帝汶\",\"103\":\"格鲁吉亚\",\"104\":\"印度\",\"105\":\"印度尼西亚\",\"106\":\"伊朗\",\"107\":\"日本\",\"108\":\"哈萨克斯坦\",\"109\":\"朝鲜\",\"110\":\"韩国\",\"111\":\"吉尔吉斯斯坦\",\"112\":\"老挝\",\"113\":\"马来西亚\",\"114\":\"蒙古\",\"115\":\"尼泊尔\",\"116\":\"巴基斯坦\",\"117\":\"菲律宾\",\"118\":\"俄罗斯\",\"119\":\"新加坡\",\"120\":\"斯里兰卡\",\"121\":\"塔吉克斯坦\",\"122\":\"泰国\",\"123\":\"土库曼斯坦\",\"124\":\"乌兹别克斯坦\",\"125\":\"越南\",\"126\":\"中国\",\"127\":\"中国\",\"128\":\"中国\",\"129\":\"阿尔巴尼亚\",\"130\":\"安道尔\",\"131\":\"奥地利\",\"132\":\"白俄罗斯\",\"133\":\"比利时\",\"134\":\"波斯尼亚和黑塞哥维那\",\"135\":\"保加利亚\",\"136\":\"克罗地亚\",\"137\":\"捷克\",\"138\":\"丹麦\",\"139\":\"爱沙尼亚\",\"140\":\"芬兰\",\"141\":\"法国\",\"142\":\"德国\",\"143\":\"希腊\",\"144\":\"匈牙利\",\"145\":\"冰岛\",\"146\":\"爱尔兰\",\"147\":\"意大利\",\"148\":\"拉脱维亚\",\"149\":\"列支敦士登\",\"150\":\"立陶宛\",\"151\":\"卢森堡\",\"152\":\"马其顿\",\"153\":\"马耳他\",\"154\":\"摩尔多瓦\",\"155\":\"摩纳哥\",\"156\":\"黑山\",\"157\":\"荷兰\",\"158\":\"挪威\",\"159\":\"波兰\",\"160\":\"葡萄牙\",\"161\":\"罗马尼亚\",\"162\":\"圣马力诺\",\"163\":\"塞尔维亚\",\"164\":\"斯洛伐克\",\"165\":\"斯洛文尼亚\",\"166\":\"西班牙\",\"167\":\"瑞典\",\"168\":\"瑞士\",\"169\":\"乌克兰\",\"170\":\"英国\",\"171\":\"梵蒂冈\",\"172\":\"塞浦路斯\",\"173\":\"土耳其\",\"175\":\"澳大利亚\",\"176\":\"斐济\",\"177\":\"基里巴斯共和国\",\"178\":\"马绍尔群岛\",\"179\":\"密克罗尼西亚\",\"180\":\"瑙鲁\",\"181\":\"新西兰\",\"182\":\"帕劳\",\"183\":\"巴布亚新几内亚\",\"184\":\"美属萨摩亚\",\"185\":\"所罗门群岛\",\"186\":\"汤加\",\"187\":\"图瓦卢\",\"188\":\"瓦努阿图\",\"189\":\"新喀里多尼亚\",\"190\":\"巴林\",\"191\":\"伊拉克\",\"192\":\"以色列\",\"193\":\"约旦\",\"194\":\"科威特\",\"195\":\"黎巴嫩\",\"196\":\"阿曼\",\"197\":\"卡塔尔\",\"198\":\"沙特阿拉伯\",\"199\":\"叙利亚\",\"200\":\"阿联酋\",\"201\":\"也门\",\"202\":\"波多黎各\",\"203\":\"开曼群岛\",\"204\":\"南苏丹\",\"205\":\"科索沃\",\"01\":\"安提瓜和巴布达\",\"03\":\"巴巴多斯\",\"02\":\"巴哈马\",\"04\":\"伯利兹\",\"08\":\"多米尼加\",\"09\":\"多米尼克\",\"06\":\"哥斯达黎加\",\"07\":\"古巴\",\"05\":\"加拿大\"}";
    public static final String Country_FusionId_Mapping = "{\"安提瓜和巴布达\":\"01\",\"巴哈马\":\"02\",\"巴巴多斯\":\"03\",\"伯利兹\":\"04\",\"加拿大\":\"05\",\"哥斯达黎加\":\"06\",\"古巴\":\"07\",\"多米尼加\":\"08\",\"多米尼克\":\"09\",\"萨尔瓦多\":\"10\",\"格林纳达\":\"11\",\"危地马拉\":\"12\",\"海地\":\"13\",\"洪都拉斯\":\"14\",\"牙买加\":\"15\",\"墨西哥\":\"16\",\"尼加拉瓜\":\"17\",\"巴拿马\":\"18\",\"圣基茨和尼维斯\":\"19\",\"圣卢西亚\":\"20\",\"圣文森特和格林纳丁斯\":\"21\",\"特立尼达和多巴哥\":\"22\",\"美国\":\"23\",\"格陵兰\":\"24\",\"阿根廷\":\"25\",\"玻利维亚\":\"26\",\"巴西\":\"27\",\"智利\":\"28\",\"哥伦比亚\":\"29\",\"厄瓜多尔\":\"30\",\"马尔维纳斯群岛\":\"31\",\"法属圭亚那\":\"32\",\"圭亚那\":\"33\",\"巴拉圭\":\"34\",\"秘鲁\":\"35\",\"苏里南共和国\":\"36\",\"乌拉圭\":\"37\",\"委内瑞拉\":\"38\",\"阿尔及利亚\":\"39\",\"安哥拉\":\"40\",\"贝宁\":\"41\",\"博茨瓦纳\":\"42\",\"布基纳法索\":\"43\",\"布隆迪\":\"44\",\"喀麦隆\":\"45\",\"佛得角\":\"46\",\"中非共和国\":\"47\",\"乍得\":\"48\",\"科摩罗\":\"49\",\"科特迪瓦\":\"50\",\"刚果(金)\":\"51\",\"吉布提\":\"52\",\"埃及\":\"53\",\"赤道几内亚\":\"54\",\"厄立特里亚\":\"55\",\"埃塞俄比亚\":\"56\",\"加蓬\":\"57\",\"加纳\":\"58\",\"几内亚\":\"59\",\"几内亚比绍共和国\":\"60\",\"肯尼亚\":\"61\",\"莱索托\":\"62\",\"利比里亚\":\"63\",\"利比亚\":\"64\",\"马达加斯加\":\"65\",\"马拉维\":\"66\",\"马里\":\"67\",\"毛里塔尼亚\":\"68\",\"摩洛哥\":\"69\",\"莫桑比克\":\"70\",\"纳米比亚\":\"71\",\"尼日尔\":\"72\",\"尼日利亚\":\"73\",\"卢旺达\":\"74\",\"圣多美和普林西比\":\"75\",\"塞内加尔\":\"76\",\"塞舌尔\":\"77\",\"塞拉利昂\":\"78\",\"索马里\":\"79\",\"南非\":\"80\",\"苏丹\":\"81\",\"斯威士兰\":\"82\",\"坦桑尼亚\":\"83\",\"多哥\":\"84\",\"突尼斯\":\"85\",\"乌干达\":\"86\",\"西撒哈拉\":\"87\",\"赞比亚\":\"88\",\"津巴布韦\":\"89\",\"冈比亚\":\"90\",\"刚果\":\"91\",\"毛里求斯\":\"92\",\"阿富汗\":\"93\",\"亚美尼亚\":\"94\",\"阿塞拜疆\":\"95\",\"孟加拉\":\"96\",\"不丹\":\"97\",\"文莱\":\"98\",\"缅甸\":\"99\",\"柬埔寨\":\"100\",\"中国\":\"101\",\"东帝汶\":\"102\",\"格鲁吉亚\":\"103\",\"印度\":\"104\",\"印度尼西亚\":\"105\",\"伊朗\":\"106\",\"日本\":\"107\",\"哈萨克斯坦\":\"108\",\"朝鲜\":\"109\",\"韩国\":\"110\",\"吉尔吉斯斯坦\":\"111\",\"老挝\":\"112\",\"马来西亚\":\"113\",\"蒙古\":\"114\",\"尼泊尔\":\"115\",\"巴基斯坦\":\"116\",\"菲律宾\":\"117\",\"俄罗斯\":\"118\",\"新加坡\":\"119\",\"斯里兰卡\":\"120\",\"塔吉克斯坦\":\"121\",\"泰国\":\"122\",\"土库曼斯坦\":\"123\",\"乌兹别克斯坦\":\"124\",\"越南\":\"125\",\"中国台湾\":\"126\",\"中国香港\":\"127\",\"中国澳门\":\"128\",\"阿尔巴尼亚\":\"129\",\"安道尔\":\"130\",\"奥地利\":\"131\",\"白俄罗斯\":\"132\",\"比利时\":\"133\",\"波斯尼亚和黑塞哥维那\":\"134\",\"保加利亚\":\"135\",\"克罗地亚\":\"136\",\"捷克\":\"137\",\"丹麦\":\"138\",\"爱沙尼亚\":\"139\",\"芬兰\":\"140\",\"法国\":\"141\",\"德国\":\"142\",\"希腊\":\"143\",\"匈牙利\":\"144\",\"冰岛\":\"145\",\"爱尔兰\":\"146\",\"意大利\":\"147\",\"拉脱维亚\":\"148\",\"列支敦士登\":\"149\",\"立陶宛\":\"150\",\"卢森堡\":\"151\",\"马其顿\":\"152\",\"马耳他\":\"153\",\"摩尔多瓦\":\"154\",\"摩纳哥\":\"155\",\"黑山\":\"156\",\"荷兰\":\"157\",\"挪威\":\"158\",\"波兰\":\"159\",\"葡萄牙\":\"160\",\"罗马尼亚\":\"161\",\"圣马力诺\":\"162\",\"塞尔维亚\":\"163\",\"斯洛伐克\":\"164\",\"斯洛文尼亚\":\"165\",\"西班牙\":\"166\",\"瑞典\":\"167\",\"瑞士\":\"168\",\"乌克兰\":\"169\",\"英国\":\"170\",\"梵蒂冈\":\"171\",\"塞浦路斯\":\"172\",\"土耳其\":\"173\",\"澳大利亚\":\"175\",\"斐济\":\"176\",\"基里巴斯共和国\":\"177\",\"马绍尔群岛\":\"178\",\"密克罗尼西亚\":\"179\",\"瑙鲁\":\"180\",\"新西兰\":\"181\",\"帕劳\":\"182\",\"巴布亚新几内亚\":\"183\",\"美属萨摩亚\":\"184\",\"所罗门群岛\":\"185\",\"汤加\":\"186\",\"图瓦卢\":\"187\",\"瓦努阿图\":\"188\",\"新喀里多尼亚\":\"189\",\"巴林\":\"190\",\"伊拉克\":\"191\",\"以色列\":\"192\",\"约旦\":\"193\",\"科威特\":\"194\",\"黎巴嫩\":\"195\",\"阿曼\":\"196\",\"卡塔尔\":\"197\",\"沙特阿拉伯\":\"198\",\"叙利亚\":\"199\",\"阿联酋\":\"200\",\"也门\":\"201\",\"波多黎各\":\"202\",\"开曼群岛\":\"203\",\"南苏丹\":\"204\",\"科索沃\":\"205\",\"百慕大\":\"\",\"法罗群岛\":\"\",\"法属波利尼西亚\":\"\",\"瓜德罗普\":\"\",\"留尼汪岛\":\"\",\"马恩岛\":\"\",\"马尔代夫\":\"\",\"马提尼克岛\":\"\"}";
    //-注册用户的默认等级
    public static final int WUM_USER_LEVEL = 5;
    public static final String RECOMMEND = "Camera Hikvision, Siemens Switzerland Ltd";
    public static final String VISION_PICTURE_TAGS = "交通设施,学校,办公场所,政府机构,营业场所,基础设施,室内,景区,室外,银行金融,保密部门,网络机房,居民家中,医院,工厂设备,公安部门";
    //--------------------------------数据常量↑---------------------------//
}